backend/controllers/ProblemController.php

    public function actionIndex()
    {
    	$query=Problem::find();
	 	$res=ProblemCate::finds();
		$pagination=new Pagination([
		    'defaultPageSize'=>2,
		    'totalCount'=>$query->count(),
			]);

    	//搜索选项入口
    	if(isset($_POST['token']))
    	{
		    if($_POST['Cate']=='-1'){

	 		}else{

	 			$query->where(["ProblemId"=>$_POST['Cate']]);
	 		}
	 		if($_POST['Hot']=='-1'){

	 		}else{
	 			$query->andWhere(['IsHot'=>$_POST['Hot']]);
	 		}
			$problems=$query->offset($pagination->offset)->limit($pagination->limit)->asArray()->all();
			//构建问题所属分类信息
			foreach ($problems as $key => $value) {
					 $problems[$key]['CateName']=ProblemCate::find()->where(['ID'=>$value['ProblemId']])->asArray()->one();
			}
	 	}else{
	 		$problems=$query->asArray()->offset($pagination->offset)->limit($pagination->limit)->all();
			//构建问题所属分类信息
			foreach ($problems as $key => $value) {
					 $problems[$key]['CateName']=ProblemCate::find('CateName')->where(['ID'=>$value['ProblemId']])->asArray()->one();
---
SELECT COUNT(*) FROM `jw_Problem`
SELECT * FROM `jw_Problem` LIMIT 2
SELECT * FROM `jw_ProblemCate` WHERE `ID`='19'