backend/controllers/TemplateController.php

    public function actionIndex()
    {
        $query=Template::find();
        $pagination=new Pagination([
            'defaultPageSize'=>5,
            'totalCount'=>$query->count(),
        ]);
        $temps=$query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT COUNT(*) FROM `jw_Template`
SELECT * FROM `jw_Template` LIMIT 5