backend/controllers/TemplateCateController.php

    public function actionIndex()
    {
        $query = TemplateCate::find();
        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),
        ]);
        $temps= $query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT COUNT(*) FROM `jw_TemplateCate`
SELECT * FROM `jw_TemplateCate` LIMIT 5