common/models/ProblemCate.php

SELECT * FROM `jw_ProblemCate`
---
    public static function finds()
    {
        //返回分类名称和ID的对应信息
        //
        $res=self::find()->asArray()->all();