backend/models/LoginForm.php

UPDATE `user` SET `auth_key`='0NKImgKnXLKcn1ywYYECLioDdgV8vmAg', `updated_at`=1531101166 WHERE `id`=4
---
    public function onGenerateApiToken()
    {
        $this->_user->generateAuthKey();
        $this->_user->save(false);